%lianxi 
% x=-pi:2*pi/300:pi;
% y=sin(x);
% plot(x,y);
% print(gcf,'-dpng','abc.png');   % 保存为png格式的图片。
% print(gcf,'-noui','-dbitmap','abc.bmp');   % 保存为bmp格式的图片。

% x=[-2.5:0.5:2.5];
% y=exp(-x.*x);
% bar(x,y)

% bdw=0.01;                         % 左右两侧边和底边的宽度
% tpw=0.15;                         % 顶边宽度     不能太小
% pos=[1/2+bdw,2/3+bdw;1/2-2*bdw,1/3-bdw-tpw];
% figure('Units','normalized','Position',pos,'Color',[0.9,0.65,0]);  % 窗口的几何、背景色进行设置
% set(gcf,'Name','test')
% 
% b=ones(16,16)*NaN;
% b(1,5)=1;                        %第一行
% b(2:14,4)=1;                     %第四列，笔画的第一列
% b(15,5)=1;
% b(16,6:11)=1;                    %最低行，笔画的最下一行
% b(15,12)=1;
% b(9:14,13)=1;
% b(2:9,6)=1;
% b(9,7)=1;
% b(8,8)=1;b(9,9)=1;
% b(8,10)=1;b(9,11)=1;b(8,12)=1;
% b(2:14,5)=2;b(10:15,6:11)=2;b(9,8)=2;b(9,10)=2;b(9:14,12)=2;
% set(gcf,'Pointer','Custom','PointerShapeCData',b,'PointerShapeHotSpot',[2,5])



b=ones(16,16)*255;
b(1,5)=1;                        %第一行
b(2:14,4)=1;                     %第四列，笔画的第一列
b(15,5)=1;
b(16,6:11)=1;                    %最低行，笔画的最下一行
b(15,12)=1;
b(9:14,13)=1;
b(2:9,6)=1;
b(9,7)=1;
b(8,8)=1;b(9,9)=1;
b(8,10)=1;b(9,11)=1;b(8,12)=1;
b(2:14,5)=2;b(10:15,6:11)=2;b(9,8)=2;b(9,10)=2;b(9:14,12)=2;

imwrite(uint8(b),'b.bmp','bmp');   % 保存为bmp格式的数字图像  im_equ,'girl128_equ.bmp','bmp'

